# Напишите код, который переводит строку в целое число, 
# при том что его можно применить в любой системе счисления.

print(int('abcd', base=16))