# Напишите программу, которая принимает имя файла и выводит его расширение. 
# Если расширение у файла определить невозможно, выбросите исключение.

file_name = 'info.txt'.split('.')
print()